# Задача 4: 
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

s = int(input('Введите колличество сделаных журавликов: '))
if s%3 == 0 and s%2 == 0:
    print(f'Петя сделал {s/3/2} журавликов')
    print(f'Катя сделала {s/3*2} журавликов')
    print(f'Сережа сделал {s/3/2} журавликов')
else:
    print ('Вы ввели некорректное колличество сделанных журавликов')